{
  "domain": "messaging_system",
  "description": "Tools for user messaging and communication within workspaces",
  "tool_count": 3,
  "tools": [
    {
      "name": "delete_message",
      "description": "Delete a specified message from a user's message history in a workspace.",
      "parameters": {
        "receiver_id": {
          "type": "string",
          "description": "Unique identifier of the user to whom the message was sent."
        },
        "message_id": {
          "type": "integer",
          "description": "Unique identifier of the message that is to be deleted."
        }
      },
      "returns": {
        "type": "dict",
        "properties": {
          "deleted_status": {
            "type": "boolean",
            "description": "Indicates whether the deletion was successful (True) or not (False)."
          },
          "message_id": {
            "type": "integer",
            "description": "Unique identifier of the message that was deleted."
          },
          "message": {
            "type": "string",
            "description": "A descriptive message providing the result of the deletion process."
          }
        }
      }
    },
    {
      "name": "message_login",
      "description": "Authenticates a user for the messaging application using their unique user ID.",
      "parameters": {
        "user_id": {
          "type": "string",
          "description": "The unique identifier of the user attempting to log in."
        }
      },
      "returns": {
        "type": "dict",
        "properties": {
          "login_status": {
            "type": "boolean",
            "description": "Indicates whether the login was successful (True) or failed (False)."
          },
          "message": {
            "type": "string",
            "description": "Detailed message providing feedback on the login attempt, such as success or failure reasons."
          }
        }
      }
    },
    {
      "name": "send_message",
      "description": "Sends a message to a specified user within a workspace for user interaction.",
      "parameters": {
        "receiver_id": {
          "type": "string",
          "description": "The unique user ID of the recipient to whom the message will be sent."
        },
        "message": {
          "type": "string",
          "description": "The content of the message that is to be transmitted to the recipient."
        }
      },
      "returns": {
        "type": "dict",
        "properties": {
          "sent_status": {
            "type": "boolean",
            "description": "Indicates whether the message was sent successfully (true) or not (false)."
          },
          "message_id": {
            "type": "integer",
            "description": "A unique identifier for the message that was successfully sent."
          },
          "message": {
            "type": "string",
            "description": "A textual description of the outcome of the message sending attempt, providing additional information."
          }
        }
      }
    }
  ]
}